#[allow(dead_code)]
pub const DIGITS: &[char; 10] = &['0', '1', '2', '3', '4', '5', '6', '7', '8', '9'];

#[allow(dead_code)]
pub const LOWERCASE_LETTERS: &[char; 26] = &[
    'a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j', 'k', 'l', 'm', 'n', 'o', 'p', 'q', 'r', 's',
    't', 'u', 'v', 'w', 'x', 'y', 'z',
];

#[allow(dead_code)]
pub const GREEK_LOWERCASE: &[char; 24] = &[
    'α', 'β', 'γ', 'δ', 'ε', 'ζ', 'η', 'θ', 'ι', 'κ', 'λ', 'μ', 'ν', 'ξ', 'ο', 'π', 'ρ', 'σ', 'τ',
    'υ', 'φ', 'χ', 'ψ', 'ω',
];

#[allow(dead_code)]
pub const GREEK_UPPERCASE: &[char; 24] = &[
    'Α', 'Β', 'Γ', 'Δ', 'Ε', 'Ζ', 'Η', 'Θ', 'Ι', 'Κ', 'Λ', 'Μ', 'Ν', 'Ξ', 'Ο', 'Π', 'Ρ', 'Σ', 'Τ',
    'Υ', 'Φ', 'Χ', 'Ψ', 'Ω',
];

#[allow(dead_code)]
pub const RUSSIAN_LOWERCASE: &[char; 31] = &[
    'а', 'б', 'в', 'г', 'д', 'е', 'ё', 'ж', 'з', 'и', 'й', 'к', 'л', 'м', 'н', 'о', 'п', 'р', 'с',
    'т', 'у', 'ф', 'х', 'ц', 'ч', 'ш', 'щ', 'ы', 'э', 'ю', 'я',
];

#[allow(dead_code)]
pub const RUSSIAN_UPPERCASE: &[char; 31] = &[
    'А', 'Б', 'В', 'Г', 'Д', 'Е', 'Ё', 'Ж', 'З', 'И', 'Й', 'К', 'Л', 'М', 'Н', 'О', 'П', 'Р', 'С',
    'Т', 'У', 'Ф', 'Х', 'Ц', 'Ч', 'Ш', 'Щ', 'Ы', 'Э', 'Ю', 'Я',
];

#[allow(dead_code)]
pub const HEBREW: &[char; 22] = &[
    'א', 'ב', 'ג', 'ד', 'ה', 'ו', 'ז', 'ח', 'ט', 'י', 'כ', 'ל', 'מ', 'נ', 'ס', 'ע', 'פ', 'צ', 'ק',
    'ר', 'ש', 'ת',
];

#[allow(dead_code)]
pub const UPPERCASE_LETTERS: &[char; 26] = &[
    'A', 'B', 'C', 'D', 'E', 'F', 'G', 'H', 'I', 'J', 'K', 'L', 'M', 'N', 'O', 'P', 'Q', 'R', 'S',
    'T', 'U', 'V', 'W', 'X', 'Y', 'Z',
];

#[allow(dead_code)]
pub const PUNCTUATION: &[char; 29] = &[
    '!', '@', '#', '$', '%', '^', '&', '*', '(', ')', '-', '_', '=', '+', '[', ']', '{', '}', ';',
    ':', '\'', '\"', ',', '.', '<', '>', '/', '?', ' ',
];

#[allow(dead_code)]
pub const ARABIC: &[char; 28] = &[
    'ا', 'ب', 'ت', 'ث', 'ج', 'ح', 'خ', 'د', 'ذ', 'ر', 'ز', 'س', 'ش', 'ص', 'ض', 'ط', 'ظ', 'ع', 'غ',
    'ف', 'ق', 'ك', 'ل', 'م', 'ن', 'ه', 'و', 'ي',
];

#[allow(dead_code)]
pub const WESTERN_ADDITIONAL: &[char; 17] = &[
    'á', 'é', 'í', 'ó', 'ú', 'ü', 'ñ', 'ç', 'ß', 'Á', 'É', 'Í', 'Ó', 'Ú', 'Ü', 'Ñ', 'Ç',
];

#[allow(dead_code)]
pub const EXTENDED_LATIN: &[char; 128] = &[
    'Ā', 'ā', 'Ă', 'ă', 'Ą', 'ą', 'Ć', 'ć', 'Ĉ', 'ĉ', 'Ċ', 'ċ', 'Č', 'č', 'Ď', 'ď', 'Đ', 'đ', 'Ē',
    'ē', 'Ĕ', 'ĕ', 'Ė', 'ė', 'Ę', 'ę', 'Ě', 'ě', 'Ĝ', 'ĝ', 'Ğ', 'ğ', 'Ġ', 'ġ', 'Ģ', 'ģ', 'Ĥ', 'ĥ',
    'Ħ', 'ħ', 'Ĩ', 'ĩ', 'Ī', 'ī', 'Ĭ', 'ĭ', 'Į', 'į', 'İ', 'ı', 'Ĳ', 'ĳ', 'Ĵ', 'ĵ', 'Ķ', 'ķ', 'ĸ',
    'Ĺ', 'ĺ', 'Ļ', 'ļ', 'Ľ', 'ľ', 'Ŀ', 'ŀ', 'Ł', 'ł', 'Ń', 'ń', 'Ņ', 'ņ', 'Ň', 'ň', 'ŉ', 'Ŋ', 'ŋ',
    'Ō', 'ō', 'Ŏ', 'ŏ', 'Ő', 'ő', 'Œ', 'œ', 'Ŕ', 'ŕ', 'Ŗ', 'ŗ', 'Ř', 'ř', 'Ś', 'ś', 'Ŝ', 'ŝ', 'Ş',
    'ş', 'Š', 'š', 'Ţ', 'ţ', 'Ť', 'ť', 'Ŧ', 'ŧ', 'Ũ', 'ũ', 'Ū', 'ū', 'Ŭ', 'ŭ', 'Ů', 'ů', 'Ű', 'ű',
    'Ų', 'ų', 'Ŵ', 'ŵ', 'Ŷ', 'ŷ', 'Ÿ', 'Ź', 'ź', 'Ż', 'ż', 'Ž', 'ž', 'ſ',
];

#[allow(dead_code)]
pub const MATH_SYMBOLS: &[char; 88] = &[
    '+', '-', '×', '÷', '=', '±', '√', '∛', '∜', '∑', '∏', '∫', '∮', '∂',
    // Comparison Operators
    '>', '<', '≥', '≤', '≠', '≡', '≪', '≫', // Set Theory
    '∈', '∉', '⊂', '⊃', '⊆', '⊇', '∅', '∪', '∩', '⊄', '⊈', // Logic Symbols
    '∧', '∨', '¬', '⇒', '⇔', '∀', '∃', '∄', // Algebraic Symbols
    'ℕ', 'ℤ', 'ℚ', 'ℝ', 'ℂ', // Number Theory
    'ℵ', // Geometry Symbols
    '∠', '∟', '∡', '∢', '⊥', '∥', '△', '▽', // Calculus Symbols
    '∂', '∇', '∫', '∮', '∯', // Miscellaneous
    '∝', '∞', '≈', '≅', '≗', // Special Symbols
    '⊕', '⊗', '⊘', '⊙', '⊚', '⊛', '⊝', // Operator Symbols
    '⨀', '⨁', '⨂', '⨃', '⨄', '⨅', '⨆', '⨇', '⨈', '⨉', '⨊', '⨋', '⨌', '⨍', '⨎', '⨏',
];

#[allow(dead_code)]
pub const MISC_SYMBOLS: &[char; 32] = &[
    '←', '↑', '→', '↓', '↔', '↕', '↖', '↗', '↘', '↙', '↩', '↪', '↫', '↬', '↭', '↮', '↯', '↰', '↱',
    '↲', '↳', '↴', '↵', '↶', '↷', '↸', '↹', '↺', '↻', '↼', '↽', '↾',
];

#[allow(dead_code)]
pub const SPECIAL_CHARS: &[char; 32] = &[
    'ñ', 'ç', 'ð', 'þ', 'æ', 'é', 'à', 'è', 'ê', 'í', 'ò', 'ó', 'ú', 'û', 'ä', 'ö', 'ü', 'ß', 'œ',
    'ø', 'å', 'ą', 'ć', 'ę', 'ł', 'ń', 'ó', 'ś', 'ź', 'ż', 'š', 'ž',
];

#[allow(dead_code)]
pub const JAPANESE: &[char; 142] = &[
    'あ', 'い', 'う', 'え', 'お', 'か', 'き', 'く', 'け', 'こ', 'さ', 'し', 'す', 'せ', 'そ', 'た',
    'ち', 'つ', 'て', 'と', 'な', 'に', 'ぬ', 'ね', 'の', 'は', 'ひ', 'ふ', 'へ', 'ほ', 'ま', 'み',
    'む', 'め', 'も', 'や', 'ゆ', 'よ', 'ら', 'り', 'る', 'れ', 'ろ', 'わ', 'を', 'ん', 'が', 'ぎ',
    'ぐ', 'げ', 'ご', 'ざ', 'じ', 'ず', 'ぜ', 'ぞ', 'だ', 'ぢ', 'づ', 'で', 'ど', 'ば', 'び', 'ぶ',
    'べ', 'ぼ', 'ぱ', 'ぴ', 'ぷ', 'ぺ', 'ぽ', 'ア', 'イ', 'ウ', 'エ', 'オ', 'カ', 'キ', 'ク', 'ケ',
    'コ', 'サ', 'シ', 'ス', 'セ', 'ソ', 'タ', 'チ', 'ツ', 'テ', 'ト', 'ナ', 'ニ', 'ヌ', 'ネ', 'ノ',
    'ハ', 'ヒ', 'フ', 'ヘ', 'ホ', 'マ', 'ミ', 'ム', 'メ', 'モ', 'ヤ', 'ユ', 'ヨ', 'ラ', 'リ', 'ル',
    'レ', 'ロ', 'ワ', 'ヲ', 'ン', 'ガ', 'ギ', 'グ', 'ゲ', 'ゴ', 'ザ', 'ジ', 'ズ', 'ゼ', 'ゾ', 'ダ',
    'ヂ', 'ヅ', 'デ', 'ド', 'バ', 'ビ', 'ブ', 'ベ', 'ボ', 'パ', 'ピ', 'プ', 'ペ', 'ポ',
];

#[allow(dead_code)]
pub const CHINESE: &[char; 89] = &[
    '你', '好', '中', '国', '人', '我', '是', '的', '了', '在', '有', '和', '这', '个', '吗', '他',
    '们', '她', '也', '会', '说', '汉', '字', '学', '习', '问', '答', '校', '家', '木', '水', '火',
    '土', '言', '口', '足', '女', '心', '耳', '目', '鼻', '竹', '牛', '羊', '犬', '亜', '哀', '愛',
    '安', '暗', '意', '医', '音', '引', '因', '印', '院', '魚', '運', '化', '花', '害', '感', '気',
    '期', '級', '空', '語', '考', '行', '計', '強', '教', '聞', '語', '合', '海', '会', '客', '間',
    '開', '約', '陽', '良', '詩', '小', '種', '成', '同',
];

#[allow(dead_code)]
pub const KOREAN: &[char; 59] = &[
    'ㄱ', 'ㄲ', 'ㄴ', 'ㄷ', 'ㄸ', 'ㄹ', 'ㅁ', 'ㅂ', 'ㅃ', 'ㅅ', 'ㅆ', 'ㅇ', 'ㅈ', 'ㅉ', 'ㅊ', 'ㅌ',
    'ㅍ', 'ㅎ', 'ㅏ', 'ㅐ', 'ㅑ', 'ㅒ', 'ㅓ', 'ㅔ', 'ㅕ', 'ㅖ', 'ㅗ', 'ㅘ', 'ㅙ', 'ㅚ', 'ㅛ', 'ㅜ',
    'ㅝ', 'ㅞ', 'ㅟ', 'ㅠ', 'ㅡ', 'ㅢ', 'ㅣ', '가', '각', '간', '갇', '갈', '감', '갑', '갓', '강',
    '갔', '갖', '갗', '갘', '같', '갚', '갛', '개', '객', '갞', '갟',
];

#[allow(dead_code)]
pub const ADDITIONAL_EAST_CHARACTERS: &[char; 256] = &[
    // Thai Characters
    'ก', 'ข', 'ค', 'ง', 'จ', 'ฉ', 'ช', 'ซ', 'ฌ', 'ญ', 'ฎ', 'ฏ', 'ฐ', 'ฑ', 'ฒ', 'ณ', 'ด', 'ต', 'ถ',
    'ท', 'ธ', 'น', 'บ', 'ป', 'ผ', 'ฝ', 'พ', 'ฟ', 'ภ', 'ม', 'ย', 'ร', 'ฤ', 'ล', 'ฦ', 'ว', 'ศ', 'ษ',
    'ส', 'ห', 'ฬ', 'อ', 'ฮ', 'ะ', 'า', 'ิ', 'ี', 'ึ', 'ื', 'ุ', 'ู', 'เ', 'แ', 'โ', 'ใ', 'ไ', 'ຍ',
    // Devanagari Characters
    'अ', 'आ', 'इ', 'ई', 'उ', 'ऊ', 'ऋ', 'ॠ', 'ऌ', 'ॡ', 'ए', 'ऐ', 'ओ', 'औ', 'क', 'ख', 'ग', 'घ', 'च',
    'छ', 'ज', 'झ', 'ट', 'ठ', 'ड', 'ढ', 'ण', 'त', 'थ', 'द', 'ध', 'न', 'प', 'फ', 'ब', 'भ', 'म', 'य',
    'र', 'ल', 'व', 'श', 'ष', 'स', 'ह', // Bengali Characters
    'ক', 'খ', 'গ', 'ঘ', 'ঙ', 'চ', 'ছ', 'জ', 'ঝ', 'ঞ', 'ট', 'ঠ', 'ড', 'ঢ', 'ণ', 'ত', 'থ', 'দ', 'ধ',
    'ন', 'প', 'ফ', 'ব', 'ভ', 'ম', 'য', 'র', 'ল', 'শ', 'ষ', 'স', 'হ', 'ৎ', 'অ', 'আ', 'ই', 'ঈ', 'উ',
    'ঊ', 'ঋ', 'এ', 'ঐ', 'ও', 'ঔ', // Ge'ez (Ethiopic) Characters
    'ሀ', 'ሁ', 'ሂ', 'ሃ', 'ሄ', 'ህ', 'ሆ', 'ለ', 'ሉ', 'ሊ', 'ላ', 'ሌ', 'ል', 'ሎ', 'ሐ', 'ሑ', 'ሒ', 'ሓ', 'ሔ',
    'ሕ', 'ሖ', 'ሗ', 'መ', 'ሙ', 'ሚ', 'ማ', 'ሜ', 'ም', 'ሞ', 'ሟ', 'ሠ', 'ሡ', 'ሢ', 'ሣ', 'ሤ', 'ሥ', 'ሦ', 'ሧ',
    'ረ', 'ሩ', 'ሪ', 'ራ', 'ሬ', 'ር', 'ሮ', 'ሯ', 'ሰ', 'ሱ', 'ሲ', 'ሳ', 'ሴ', 'ስ', 'ሶ', 'ሷ', 'ሸ', 'ሹ', 'ሺ',
    'ሻ', 'ሼ', 'ሽ', 'ሾ', 'ሿ', 'ቀ', 'ቁ', 'ቂ', 'ቃ', 'ቄ', 'ቅ', 'ቆ', 'ቇ', 'ቈ', '቉', 'ቊ', 'ቋ', 'ቌ', 'ቍ',
    '቎', '቏', 'ቐ', 'ቑ', 'ቒ', 'ቓ', 'ቔ', 'ቕ', 'ቖ', '቗', 'ቘ', '቙', 'ቚ', 'ቛ', 'ቜ', 'ቝ', '቞', '቟', 'በ',
    'ቡ', 'ቢ', 'ባ', 'ቤ', 'ብ', 'ቦ', 'ቧ', 'ቨ', 'ቩ', 'ቪ', 'ቫ', 'ቬ', 'ቭ', 'ቮ', 'ቯ',
];
